10_Rails_Intro/books_app/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "year_published", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Fly Girl"], ["author", "Omar Tyre"], ["year_published", 2011], ["genre", "Fiction"], ["created_at", "2015-09-01 03:41:31.753895"], ["updated_at", "2015-09-01 03:41:31.753895"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_book
      @book = Book.find(params[:id])